#!/usr/bin/env ruby
# -*- coding: utf-8 -*-
$VERBOSE = true
=begin
イカ語コンバータ in Ruby
=end

if RUBY_VERSION < '1.9'
  $KCODE = 'u'
end

require 'kconv'

class String
  def de_geso
    self.toutf8 \
      .gsub(/♪|★|☆/,'。') \
      .gsub(/～\s*$/,'～でゲソ～') \
      .gsub(/（笑）?|（藁）?\s*$/,'(ｹﾞｿw)') \
      .gsub(/すみません|すいません|ごめんなさい|ゴメンナサイ|すまぬ|スマヌ|スマン/,'ごめんなしゃいでゲショ') \
      .gsub(/ありがとうございます|ありがとう|さんくす|サンキュー|ｔｈｘ|thx|thanks|thank you/i,'ありがとうでゲソ') \
      .gsub(/いか|以下|イガ|伊賀|胃下/,'イカ') \
      .gsub(/海老/,'エビ') \
      .gsub(/化物語/,'ｲｶ物語') \
      .gsub(/遺憾/,'イカん') \
      .gsub(/お前|あなた|あんた|アンタ|アナタ|テメエ|テメー|てめえ|おまえ|オマエ|貴様|貴女|貴公|キサマ|You/i,'お主') \
      .gsub(/イク/,'イカ') \
      .gsub(/ムリダナ|無理ダナ|無理だな|ﾑﾘﾀﾞﾅ|無理だ/,'ムリじゃなイカﾀﾞﾅ') \
      .gsub(/ワロタ|ワロス|ﾜﾛﾀ|ﾜﾛｽ/,'ワロタじゃなイカ') \
      .gsub(/…\s*$/,'。') \
      .gsub(/・・\s*$/,'・・。') \
      .gsub(/。。\s*$/,'。') \
      .gsub(/。。。\s*$/,'。') \
      .gsub(/ｗ\s*$/,'ｗでゲソ。') \
      .gsub(/w\s*$/,'wでゲソ。') \
      .gsub(/います/,'いる') \
      .gsub(/れます/,'れる') \
      .gsub(/しましょう/,'しよう') \
      .gsub(/あります！/,'あります。') \
      .gsub(/ありませんか/,'なイカ') \
      .gsub(/しよう(!|！)\s*$/,'しようじゃなイカ!') \
      .gsub(/！$/,'でゲソ！') \
      .gsub(/おはよう\s*$/,'おはようでゲソ') \
      .gsub(/こんにちは\s*$/,'こんにちはでゲソ') \
      .gsub(/おやすみ\s*$/,'おやすみでゲソ') \
      .gsub(/やる\s*$/,'やらなイカ') \
      .gsub(/(するか|しません|しない)\s*$/,'するめイカ') \
      .gsub(/(だろ|だぜ)\s*$/,'じゃなイカ') \
      .gsub(/(ろよ|ろ)\s*$/,'ろでゲソ') \
      .gsub(/れ\s*$/,'れでゲソ') \
      .gsub(/え\s*$/,'えでゲソ') \
      .gsub(/た\s*$/,'たでゲソ') \
      .gsub(/る\s*$/,'るでゲソ') \
      .gsub(/なぞ\s*$/,'謎') \
      .gsub(/(だが|な|わ|だ|ぞ|けど)\s*$/,'でゲソ') \
      .gsub(/い\s*$/,'いじゃなイカ') \
      .gsub(/(じゃん|じゃね)\s*$/,'じゃなイカ') \
      .gsub(/ん\s*$/,'んゲソ') \
      .gsub(/ｋ\s*$/,'ｋゲソ') \
      .gsub(/よ\s*$/,'ゲソよ') \
      .gsub(/か\s*$/,'でゲソか') \
      .gsub(/くね\s*$/,'くなイカ') \
      .gsub(/ね\s*$/,'でゲソね') \
      .gsub(/(ぁ|ぉ|ぇ|ぅ)\s*$/,'でゲソｫ') \
      .gsub(/う\s*$/,'うじゃなイカ') \
      .gsub(/ほっとけ\s*$/,'ほっとかなイカ') \
      .gsub(/す\s*$/,'すでゲソ') \
      .gsub(/おはよう!\s*$/,'おはようでゲソ!') \
      .gsub(/こんにちは!\s*$/,'こんにちはでゲソ!') \
      .gsub(/おやすみ!\s*$/,'おやすみでゲソ!') \
      .gsub(/やる!\s*$/,'やらなイカ!') \
      .gsub(/(するか!|しません!|しない!|するか!|しません!|しない!|するか|しません|しない!)\s*$/,'するめイカ!') \
      .gsub(/(だろ!|だぜ!)\s*$/,'じゃなイカ!') \
      .gsub(/(ろよ!|ろ!)\s*$/,'ろでゲソ!') \
      .gsub(/れ!\s*$/,'れでゲソ!') \
      .gsub(/え!\s*$/,'えでゲソ!') \
      .gsub(/た!\s*$/,'たでゲソ!') \
      .gsub(/る!\s*$/,'るでゲソ!') \
      .gsub(/なぞ!\s*$/,'謎!') \
      .gsub(/(だが!|な!|わ!|だ!|ぞ!|けど!)\s*$/,'でゲソ!') \
      .gsub(/い!\s*$/,'いじゃなイカ!') \
      .gsub(/(じゃん|じゃね!)\s*$/,'じゃなイカ!') \
      .gsub(/ん!\s*$/,'んゲソ!') \
      .gsub(/ｋ!\s*$/,'ｋゲソ!') \
      .gsub(/よ!\s*$/,'ゲソよ!') \
      .gsub(/か!\s*$/,'でゲソか!') \
      .gsub(/くね!\s*$/,'くなイカ!') \
      .gsub(/ね!\s*$/,'でゲソね!!') \
      .gsub(/(ぁ!|ぉ!|ぇ!|ぅ!)\s*$/,'でゲソｫ!') \
      .gsub(/う!\s*$/,'うじゃなイカ!') \
      .gsub(/ほっとけ!\s*$/,'ほっとかなイカ!') \
      .gsub(/す!/,"すでゲソ!") \
      .gsub(/か？/,'でゲソか?') \
      .gsub(/な？/,'でゲソね?') \
      .gsub(/よ？/,'でゲソか?') \
      .gsub(/？/,'ゲソ?') \
      .gsub(/い。|いです。/,'いじゃなイカ｡') \
      .gsub(/（＾＾；/,'。') \
      .gsub(/＾＾；/,'。') \
      .gsub(/＾＾/,'。') \
      .gsub(/するか。|しません。|しない。/,'するめイカ。') \
      .gsub(/です/,'でゲソ') \
      .gsub(/。/,'でゲソ｡') \
      .gsub(/る」/,'るじゃなイカ」') \
      .gsub(/か」/,'でゲソか」') \
      .gsub(/た」/,'たでゲソ」') \
      .gsub(/す」|だ」/,'でゲソ」') \
      .gsub(/よ」/,'でゲソよ」') \
      .gsub(/な」/,'でゲソ」') \
      .gsub(/い」/,'いじゃなイカ」') \
      .gsub(/う」/,'うでゲソ」') \
      .gsub(/ゲソございました|ゲソございます/,'ゲソ') \
      .gsub(/かでゲ|でしょうでゲ/,'でゲ') \
      .gsub(/できますでゲ/,'できるでゲ') \
      .gsub(/れますでゲ/,'れるでゲ') \
      .gsub(/いますでゲ/,'いるでゲ') \
      .gsub(/ですでゲ/,'でゲ') \
      .gsub(/ましょう/,'ようじゃなイカ') \
      .gsub(/しましょうでゲ/,'するでゲ') \
      .gsub(/きましょうでゲ/,'くでゲ') \
      .gsub(/行きますでゲ/,'行くでゲ') \
      .gsub(/くださいでゲ/,'くれでゲ') \
      .gsub(/よでゲソ/,'でゲソよ') \
      .gsub(/ねでゲソ/,'でゲソね') \
      .gsub(/お願いいたします/,'お願いしようじゃなイカ') \
      .gsub(/だでゲソ/,'でゲソ') \
      .gsub(/イカ ゲソ|イカでゲソ|イカ。でゲソ|イカゲソ|イカソ/,'イカ') \
      .gsub(/というでゲソ/,'というじゃなイカ') \
      .gsub(/ソ。っ/,'ソっ') \
      .gsub(/ソでゲソ|ソねゲソ|ソかゲソ|ソ。でゲソ/,'ソ') \
      .gsub(/ゲソかでゲソね|ゲソよでゲソね|でゲソしでゲソね|ゲソわでゲソね/,'ゲソね。') \
      .gsub(/みましょうでゲソでゲソ。/,'みるでゲソ｡') \
      .gsub(/皆さまでゲソ/,'皆さま') \
      .gsub(/違いるでゲソので/,'違うのでゲソ') \
      .gsub(/だゲソよ/,'じゃなイカ') \
      .gsub(/重で/,'重ね') \
      .gsub(/ゲソねが/,'ゲソが') \
      .gsub(/思いる/,'思う') \
      .gsub(/違いる/,'違う') \
      .gsub(/買いる/,'買う') \
      .gsub(/言いる/,'言う') \
      .gsub(/楽しみよう/,'楽しもう') \
      .gsub(/楽しみる/,'楽しむ') \
      .gsub(/配りよう/,'配ろう') \
      .gsub(/遊びよう|あそびよう/,'遊ぼう') \
      .gsub(/知りよう/,'知ろう') \
      .gsub(/行きよう/,'行こう') \
      .gsub(/紙一重ね/,'紙一重え') \
      .gsub(/ご覧くれ|ごらんくれ/,'見る') \
      .gsub(/ご覧くれ|ごらんくれ/,'見る') \
      .gsub(/ございる/,'ゲソ') \
      .gsub(/ありますでゲソ/,'あるでゲソ') \
      .gsub(/でありまでゲソ/,'でゲソ') \
      .gsub(/であるでゲソ/,'ゲソ') \
      .gsub(/やりようじゃなイカ/,'やろうじゃなイカ') \
      .gsub(/じゃなイカじゃなイカ/,'じゃなイカ') \
      .gsub(/ゲソゲソ|ゲソゲソゲソ|ゲソのででゲソ|ゲソからでゲソ/,'ゲソ') \
      .gsub(/ゲショでゲソ|ゲショ｡でゲソ/,'ゲショ') \
      .gsub(/でゲソ｡でゲソ|でゲソでゲソ|ゲソのでゲソ|ででゲソ|ゲソでゲソ/,'でゲソ') \
      .gsub(/ぜでゲソ｡/,'じゃなイカ｡') \
      .gsub(/ゲソがでゲソ/,'ゲソが') \
      .gsub(/なんじゃなイカ/,'なんでゲソ') \
      .gsub(/ゲソよかゲソ|ゲソかねゲソ|ゲソよゲソ|ゲソでゲソ|ゲソのゲソ/,'ゲソ') \
      .gsub(/でゲソねでゲソね/,'でゲソね') \
      .gsub(/ゲソねよ/,'ゲソね') \
      .gsub(/ゲソねね/,'ゲソね') \
      .gsub(/しまいるでゲソ/,'しまうでゲソ') \
      .gsub(/ゲソぐに/,'すぐに') \
      .gsub(/死でゲソね/,'死ななイカ') \
      .gsub(/ていきようじゃなイカ/,'ていこうじゃなイカ') \
      .gsub(/ておきようじゃなイカ/,'ておこうじゃなイカ') \
      .gsub(/ておきようじゃなイカ/,'ておこうじゃなイカ') \
      .gsub(/～でゲソ～でゲソ～/,'～でゲソ～')
  end
  alias to_ikago de_geso
end

if __FILE__ == $PROGRAM_NAME
  puts ARGF.read.to_ikago
end
